Revit 2026 API

# IndexStream Properties

---

The IndexStream type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IndexStream Class

Autodesk.Revit.DB.DirectContext3D Namespace